Autodesk.Revit.UI.ICustomFieldEditPropertiesServerProxy.EditProperties(Autodesk.Revit.DB.ICustomFieldProperties,Autodesk.Revit.DB.ScheduleField,System.IntPtr)
Override this function to start editing the custom field properties.
When this function is called it should launch the properties dialog which will allow the user to
modify the values for the input properties.
The edited properties should not be written into the Revit document during the call of this function,
they should just be returned. Once that the parent dialog is closed by pressing the OK button
it will be called Autodesk.Revit.DB.ICustomFieldServer.SetCustomFieldProperties(Autodesk.Revit.DB.ICustomFieldProperties,Autodesk.Revit.DB.ScheduleField).
which will have as an argument the properties returned by this function.
If the parent dialog is closed by pressing the Cancel button, the edited properties will be
discarded (they will not be saved into the document).
customFieldPropertiesToBeEdited:
The prioperties that needs to be edited.
By default, these properties are the ones saved for the custom field.
They will be obtained by calling Autodesk.Revit.DB.ICustomFieldServer.GetCustomFieldProperties(Autodesk.Revit.DB.ScheduleField).
Once that the properties are edited and returned by this function they will be used as an input for
the next call to this function until the parent dialog will be closed.
scheduleField:
The field that is controlled by this server.
parentWindowHandle:
The handle of the current opened window.
Returns:
Returns an instance of Autodesk.Revit.DB.ICustomFieldProperties which
represent the edited properties (with the new values).
If the properties were not edited, it should return null. For example, if the user
close the edit custom field properties dialog by pressing Cancel button, it should return null.

Autodesk.Revit.UI.ICustomFieldEditPropertiesServerProxy.GetCustomFieldServerId
Gets the id of the server that defines the custom field whose properties are edited.
Returns:
Returns the id of the server that defines the custom field whose properties are edited.